# IFC_SetEntityProp

## Description
Sets the value of a selected property from the IFC entity

```pascal
FUNCTION IFC_SetEntityProp(
				hObject        : HANDLE;
				inStrPropName  : STRING;
				inStrPropValue : STRING) : BOOLEAN;
```

```python

def vs.IFC_SetEntityProp(hObject, inStrPropName, inStrPropValue):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|inStrPropName|STRING||
|inStrPropValue|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* IFC